; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=39, out_folder=htg/blocksworld/training, instance_id=19, seed=2043

(define (problem blocksworld-19)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 - object)
 (:init 
    (arm-empty)
    (clear b7)
    (on b7 b10)
    (on b10 b13)
    (on b13 b25)
    (on b25 b28)
    (on-table b28)
    (clear b3)
    (on b3 b19)
    (on b19 b20)
    (on b20 b6)
    (on b6 b29)
    (on b29 b24)
    (on b24 b38)
    (on b38 b2)
    (on b2 b1)
    (on-table b1)
    (clear b8)
    (on b8 b11)
    (on b11 b35)
    (on b35 b22)
    (on b22 b39)
    (on b39 b4)
    (on b4 b18)
    (on b18 b34)
    (on b34 b21)
    (on b21 b14)
    (on-table b14)
    (clear b12)
    (on b12 b15)
    (on b15 b23)
    (on b23 b5)
    (on b5 b32)
    (on b32 b26)
    (on b26 b33)
    (on-table b33)
    (clear b17)
    (on b17 b30)
    (on b30 b9)
    (on b9 b27)
    (on b27 b36)
    (on b36 b37)
    (on b37 b16)
    (on b16 b31)
    (on-table b31))
 (:goal  (and 
    (clear b1)
    (on b1 b3)
    (on b3 b2)
    (on-table b2))))

; plan
1. (unstack b3 b19)
   deleted: (on b3 b19) (clear b3) (arm-empty)
   added: (holding b3) (clear b19)
   goals met: 0 of 4
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 4
3. (unstack b19 b20)
   deleted: (on b19 b20) (clear b19) (arm-empty)
   added: (holding b19) (clear b20)
   goals met: 0 of 4
4. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 4
5. (unstack b20 b6)
   deleted: (on b20 b6) (clear b20) (arm-empty)
   added: (holding b20) (clear b6)
   goals met: 0 of 4
6. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 4
7. (unstack b6 b29)
   deleted: (on b6 b29) (clear b6) (arm-empty)
   added: (holding b6) (clear b29)
   goals met: 0 of 4
8. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 4
9. (unstack b29 b24)
   deleted: (on b29 b24) (clear b29) (arm-empty)
   added: (holding b29) (clear b24)
   goals met: 0 of 4
10. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 0 of 4
11. (unstack b24 b38)
   deleted: (on b24 b38) (clear b24) (arm-empty)
   added: (holding b24) (clear b38)
   goals met: 0 of 4
12. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 4
13. (unstack b38 b2)
   deleted: (on b38 b2) (clear b38) (arm-empty)
   added: (holding b38) (clear b2)
   goals met: 0 of 4
14. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 0 of 4
15. (unstack b2 b1)
   deleted: (on b2 b1) (clear b2) (arm-empty)
   added: (holding b2) (clear b1)
   goals met: 1 of 4
16. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 2 of 4
17. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 2 of 4
18. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 3 of 4
19. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 2 of 4
20. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 4 of 4
